tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bear"
brew "bottom"
brew "fastfetch"
brew "fish"
brew "gdu"
brew "python@3.13"
brew "python@3.12"
brew "latexindent"
brew "mpich"
brew "neovim"
brew "node"
brew "python@3.9"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "tree"
brew "w3m"
brew "zola"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "adguard"
cask "adobe-creative-cloud"
cask "anki"
cask "bartender"
cask "chatgpt"
cask "claude"
cask "dropbox"
cask "element"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "itsycal"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mos"
cask "neteasemusic"
cask "qbittorrent"
cask "steam"
cask "telegram-desktop"
cask "thunder"
cask "thunderbird"
cask "visual-studio-code"
cask "xld"
cask "zoom"
vscode "antfu.browse-lite"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "holmescn.vscode-wordcount-cjk"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "karunamurti.tera"
vscode "mechatroner.rainbow-csv"
vscode "mrmlnc.vscode-scss"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "redhat.vscode-xml"
vscode "sharzyl.cjk-word-handler"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sysoev.language-stylus"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "yzhang.markdown-all-in-one"
