tap "homebrew/bundle"
brew "bear"
brew "bottom"
brew "fastfetch"
brew "fish"
brew "git"
brew "neovim"
brew "node"
brew "ripgrep"
brew "tree"
brew "zola"
cask "1password"
cask "adguard"
cask "dropbox"
cask "firefox"
cask "font-maple-mono-nf-cn"
cask "iina"
cask "iterm2"
cask "visual-studio-code"
