brew "bear"
brew "bottom"
brew "fastfetch"
brew "fish"
brew "fnm"
brew "git"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "tree"
brew "zola"
cask "1password"
cask "adguard"
cask "clash-verge-rev"
cask "dropbox"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-maple-mono-nf-cn"
cask "iina"
cask "iterm2"
cask "itsycal"
cask "qbittorrent"
cask "telegram-desktop"
cask "visual-studio-code"
cask "xld"
